src/cf/ChartsOfCharacteristicTypes/ВопросыПоТехническимПроектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВопросыПоТехническимПроектам</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Процессы</v8:Type>
				<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
				<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
				<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1000</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяТочкаТехническогоПроекта</Name>
					<Comment>Контрольная точка технического проекта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочкиТехническихПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуален</Name>
					<Comment>Актуален</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/cf/ChartsOfCharacteristicTypes/ВопросыПоТехническимПроектам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		ТипЗначения = Новый ОписаниеТипов("Строка");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если НЕ ДанныеЗаполнения.Свойство("ТипЗначения") Тогда
			ТипЗначения = Новый ОписаниеТипов("Строка");
		КонецЕсли;
		
		Если ЭтоНовый() Тогда
			Если ДанныеЗаполнения.Свойство("Проект") Тогда
				Проект = ДанныеЗаполнения.Проект;
			КонецЕсли;
		Конецесли;
		
	КонецЕсли;
		
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Проект) Тогда
		Проект = Проекты.ПроектПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Код) Тогда
		УстановитьНовыйКодСУчетомПроекта();
	КонецЕсли;
	
	Если Родитель = Неопределено ИЛИ Родитель.Пустая() Тогда
		ПолныйКод = Код;
	Иначе
		ПолныйКод = ПолныйКодРодителя(Родитель) + Строка(Код);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолныйКодРодителя(ГруппаРодитель)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВопросыПоТехническимПроектам.ПолныйКод КАК ПолныйКод
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыПоТехническимПроектам КАК ВопросыПоТехническимПроектам
	|ГДЕ
	|	ВопросыПоТехническимПроектам.Ссылка = &ГруппаРодитель"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ГруппаРодитель", ГруппаРодитель);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПолныйКод = "";
	
	Если Выборка.Следующий() Тогда
		ПолныйКод = Выборка.ПолныйКод;
	КонецЕсли;
	
	Возврат Строка(ПолныйКод);
	
КонецФункции

Процедура УстановитьНовыйКодСУчетомПроекта()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1 
	|	Вопросы.Код КАК Код
	|ИЗ
	|	ПланВидовХарактеристик.ВопросыПоТехническимПроектам КАК Вопросы
	|ГДЕ
	|	Вопросы.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВопросыПоТехническимПроектам.ПустаяСсылка)
	|   И Вопросы.Проект = &Проект
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НовыйКод = Число(Выборка.Код) + 1;
	Иначе
		НовыйКод = 1;
	КонецЕсли;
	
    Код = Формат(НовыйКод, "ЧЦ=2; ЧДЦ=0; ЧВН=");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
